_posts/2021-12-12-boj-11052.html
---
title: BOJ 11052 카드 구매하기
tags: DP
---

<div id="outline-container-org64721fb" class="outline-2">
<h2 id="org64721fb">BOJ 11052 카드 구매하기</h2>
<div class="outline-text-2" id="text-org64721fb">
<ul class="org-ul">
<li>카드팩의 종류가 있음</li>
<li>P1 : 카드 1장 들어있음</li>
<li>P2 : 카드 2장 들어있음</li>
<li>지불해야 하는 금액의 최대값</li>
</ul>
</div>
</div>
<div id="outline-container-org336cc95" class="outline-2">
<h2 id="org336cc95">접근하기</h2>
<div class="outline-text-2" id="text-org336cc95">
<pre class="example">
예제 분석하기
5
10 9 8 7 6

1장 살때 10
2장 살때 9
3장 살때 8
4장 살때 7
5장 살때 6

dp[0] = 0
dp[1] = max(dp[1], dp[1-1] + a[1] = 10) = 10

dp[2] = max(dp[2], dp[2-1] + a[1]
                   dp[2-2] + a[2]) = 20, 9 = 20,   dp[2] = 20

dp[3] = max(dp[3], dp[3-1] + a[1], 
                   dp[3-2] + a[2], 
                   dp[3-3] + a[3]) = 30, 18, 8,    dp[3] = 30

dp[4] = max(dp[4], dp[4-1] + a[1]   30 + 10 = 40
                   dp[4-2] + a[2]   20 + 9  = 29
                   dp[4-3] + a[3]   10 + 8  = 18
                   dp[4-4] + a[4]   0 + 6  = 6     dp[4] = 40

dp[5] = max(dp[5], dp[5-1] + a[1]    50
                   dp[5-2] + a[2]    29
                   dp[5-3] + a[3]    28
                   dp[5-4] + a[4]    17
                   dp[5-5] + a[5]    6             dp[5] = 50           

점화 관계
dp[i] = max(dp[i], dp[i-j] + a[j])
</pre>
</div>
</div>

<div id="outline-container-org76992fd" class="outline-2">
<h2 id="org76992fd">코드</h2>
<div class="outline-text-2" id="text-org76992fd">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #8ae234; font-weight: bold;">vector</span> &lt;<span style="color: #8ae234; font-weight: bold;">string</span>&gt; <span style="color: #ff6347;">vp</span>(N);    
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
        <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">s</span>(str);
        vp[i] = s;
    }
    sort(vp.begin(), vp.end()); 

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 1;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 1;
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">out</span> = vp[0];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;(<span style="color: #8ae234; font-weight: bold;">int</span>)vp.size();i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (vp[i-1] == vp[i]) {
            cnt++;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            cnt = 1;
        }
        <span style="color: #729fcf; font-weight: bold;">if</span> (ans &lt; cnt) {
            ans = cnt;
            out = vp[i];
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%s\n"</span>, out.c_str());
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org872f854" class="outline-2">
<h2 id="org872f854">문제 링크</h2>
<div class="outline-text-2" id="text-org872f854">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11052">https://www.acmicpc.net/problem/11052</a></li>
</ul>
</div>
</div>
